Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
/******************************************************************************
* DISCLAIMER

* This software is supplied by Renesas Electronics Corporation and is only 
* intended for use with Renesas products. No other uses are authorized.

* This software is owned by Renesas Electronics Corporation and is protected under 
* all applicable laws, including copyright laws.

* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES 
* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, 
* INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
* PARTICULAR PURPOSE AND NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY 
* DISCLAIMED.

* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS 
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE 
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES 
* FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS 
* AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.

* Renesas reserves the right, without notice, to make changes to this 
* software and to discontinue the availability of this software.  
* By using this software, you agree to the additional terms and 
* conditions found by accessing the following link:
* http://www.renesas.com/disclaimer
******************************************************************************/
/* Copyright (C) 2011 Renesas Electronics Corporation. All rights reserved.  */
/****************************************************************************** 
* File Name    : event.c
* Version      : 1.00
* Device(s)    : RL78/I1C
* Tool-Chain   : CubeSuite Version 1.5d
* H/W Platform : RL78/I1C Energy Meter Platform
* Description  : Event processing source File
******************************************************************************
* History : DD.MM.YYYY Version Description
******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
/* Driver */
#include "r_cg_macrodriver.h"   /* CG Macro Driver */
#include "r_cg_rtc.h"           /* CG RTC Driver */
#include "r_cg_wdt.h"

#include <math.h>

/* Wrapper/User */
#include "wrp_app_ext.h"

/* MW/Core */
#include "em_core.h"        /* EM Core APIs */
//#include "em_event.h"
#include "em_display.h"

/* Application */
#include "platform.h"
#include "storage.h"        /* Storage Header File */
#include "event.h"          /* Event Header File */
//#include "powermgmt.h"      /* Power Management Header File */
#include <string.h>         /* String Standard Lib */
#include "r_lcd_display.h"
#include "r_meter_format.h"
#include "r_scheduler.h"    /* Scheduler */
#include "inst_read.h"
#include "r_tariff.h"
#include "key.h"
#include "r_load_ctrl.h"

/* Bootloader */
//#include "bl_image.h"

#include "relay.h"

/* DLMS Event */
#ifdef _DLMS
#include "r_dlms_event.h"
#include "r_dlms_push.h"
#include "r_dlms_config.h"
#include "r_dlms_tcp_wrapper_interface.h"
#include "r_dlms_udp_wrapper_interface.h"
#endif

/******************************************************************************
Macro definitions
******************************************************************************/
/* Common */
#define MAX(x, y)   ((x) < (y) ? (   y) : (x))  /* Get max value */



#define ROLLOVER_PROFILE                (TRUE)
#define NON_ROLLOVER_PROFILE            (FALSE)

/* EEPROM Storage mapping */
#define EVENT_EEPROM_BACKUP_EVENT_STATE_ADDR            (STORAGE_EEPROM_EVENT_LOG_EVENT_STATE_ADDR)
#define EVENT_EEPROM_BACKUP_EVENT_TAMPER_COUNTER_ADDR   (STORAGE_EEPROM_EVENT_LOG_TAMPER_COUNTER_ADDR)
#define EVENT_EEPROM_BACKUP_EVENT_TABLE_HEADER_ADDR     (STORAGE_EEPROM_EVENT_LOG_TABLE_INFO_ADDR)


#define EVENT_CHECK_TAMPER_UPDATING_MODE(mode, power, current_state, o_mode, o_power) {     \
    if (mode == EVENT_TAMPER_UPDATE_BY_SPECIFIED_POWER) {                                   \
        if (current_state == EVENT_STATE_ENTER) {                                           \
            o_mode = EVENT_TAMPER_UPDATE_BY_SPECIFIED_POWER;                                \
            if (o_power < power) {                                                          \
                o_power = power;                                                            \
            }                                                                               \
        }                                                                                   \
    }                                                                                       \
}

/******************************************************************************
Typedef definitions
******************************************************************************/
typedef struct tagComnPersistentTime
{
    /* EM */
    /* ENERGY monitoring */
    uint8_t   comn_remove_occur;            /* Comn module removal occurred*/
    uint8_t   comn_remove_restore;          /* Comn module removal restored*/

} COMN_PERSISTENT_TIME;

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/
/* Import from wrp_em_adc.c */
extern volatile uint8_t g_dc_immunity_state;
/* Import from inst_read.c */
extern float32_t g_inst_read_fixed_power_output_value;
extern uint8_t g_inst_read_is_fixed_power_output;

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
*****************************************************************************/
/* Variables */
float32_t g_event_overload_threshold;

EVENT_INFO g_event_state;
EVENT_FLAG g_event_flag;
EVENT_REQUEST_FLAG g_event_request_flag;
EVENT_ARGS_T EventArgs;

EVENT_PERSISTENT_TIME g_event_persistent_time = 
{
  /* EM */
    /* ENERGY monitoring */
    1, /* Low Voltage Occurred */
    1, /* Low Voltage Restored*/
    1, /* Over Voltage Occurred*/
    1, /* Over Voltage Restored*/
    1, /* Over Current Occurred*/
    1, /* Over Current Restored*/
    1, /* Current Reverse Occured*/
    1, /* Current Reverse Restored*/
    1, /* Overload Occurred*/
    1, /* Overload Restored*/
    1, /* Frequency out of range */
    1, /* Low power factor Occurred*/
    1, /* Low power factor Restored*/

    /* ENERGY tamper */
    1, /* Neutral missing Occurred */
    1, /* Neutral missing Restored*/
    1, /* Earth Connected Occurred*/
    1, /* Earth Connected Restored*/
    1, /* DC detection Occurred*/
    1, /* DC detection Restored*/

    /* Power management */
    1, /* Power Failures Occurred */
    1, /* Power Failures Restored*/
    1, /* Case open */
    1, /* Magnetic Occurred*/
    1 /* Magnetic Restored*/

