Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
};

COMN_PERSISTENT_TIME g_comn_persistent_time = 
{
    1,  /* Comn module removal occurred*/
    1   /* Comn module removal restored*/

}; //TODO

RELAY_PERSISTENT_TIME g_relay_persistent_time =
{
    1,  /* Relay Disconnect */
    1   /* Relay Reconnect */

}; //TODO

uint32_t    g_tamper_counter;

static EVENT_PLUGIN_CALLBACK gp_event_plugin_callback[1];
const uint8_t gp_event_plugin_callback_size = sizeof(gp_event_plugin_callback)/sizeof(EVENT_PLUGIN_CALLBACK);

static EventTableHeader_t gEventTableHeaders[] =
{
/* StartPosistion , EntriesInUse */
    {      0         ,     0         },
    {      0         ,     0         },
    {      0         ,     0         },
    {      0         ,     0         },
    {      0         ,     0         },
    {      0         ,     0         },
    {      0         ,     0         },
};

static const EventTableConfig_t gEventTableConfigs[] = 
{
/* EEPROM Table Start Address                  EEPROM Max entries                 Is Roll Over?          (Size of 1 record)             */
/* E.g.                                                                                                                                 */
/*  0x059E                                      50                                 TRUE                     64                          */
    {STORAGE_EEPROM_EVENT_LOG_VOLTAGE_ADDR      , VOLTAGE_EVENTS_MAX_ENTRIES       , ROLLOVER_PROFILE      , sizeof(EVENT_PARAMS_T      )},
    {STORAGE_EEPROM_EVENT_LOG_CURRENT_ADDR      , CURRENT_EVENTS_MAX_ENTRIES       , ROLLOVER_PROFILE      , sizeof(EVENT_PARAMS_T      )},
    {STORAGE_EEPROM_EVENT_LOG_POWER_ADDR        , POWER_EVENTS_MAX_ENTRIES         , ROLLOVER_PROFILE      , sizeof(EVENT_PARAMS_SHORT_T)},
    {STORAGE_EEPROM_EVENT_LOG_TRANSACTION_ADDR  , TRANS_EVENTS_MAX_ENTRIES         , ROLLOVER_PROFILE      , sizeof(EVENT_PARAMS_SHORT_T)},
    {STORAGE_EEPROM_EVENT_LOG_OTHER_ADDR        , OTHER_EVENTS_MAX_ENTRIES         , ROLLOVER_PROFILE      , sizeof(EVENT_PARAMS_T      )},
    {STORAGE_EEPROM_EVENT_LOG_NONROLLOVER_ADDR  , NON_ROLLOVER_EVENTS_MAX_ENTRIES  , NON_ROLLOVER_PROFILE  , sizeof(EVENT_PARAMS_SHORT_T)},
    {STORAGE_EEPROM_EVENT_LOG_CONTROL_ADDR      , CONTROL_EVENTS_MAX_ENTRIES       , ROLLOVER_PROFILE      , sizeof(EVENT_PARAMS_SHORT_T)},
};

/******************************************************************************
Private global variables and functions
******************************************************************************/

void  EVENT_ExtractDataForLogging(
    EVENT_ARGS_T *pEventArgsData
);

uint8_t EVENT_DetermineEventStatus(
        uint8_t               condition,
        EVENT_ONE_EVENT_TICK *pEventStatus,
        uint8_t               event_persistent_time_occur ,
        uint8_t               event_persistent_time_restore
);

/******************************************************************************
* Function Name : EVENT_RegisterPluginCallback
* Interface     : void EVENT_RegisterPluginCallback(uint8_t slot, EVENT_PLUGIN_CALLBACK p_fn_callback)
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void EVENT_RegisterPluginCallback(uint8_t slot, EVENT_PLUGIN_CALLBACK p_fn_callback)
{
    gp_event_plugin_callback[slot] = p_fn_callback;
}

/******************************************************************************
* Function Name : EVENT_FowardToPluginFn
* Interface     : void EVENT_FowardToPluginFn(EVENT_ARGS_T *pEvent_arg)
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void EVENT_FowardToPluginFn(EVENT_ARGS_T *pEvent_arg)
{
    uint8_t i;
    for (i = 0; i < gp_event_plugin_callback_size; i++)
    {
        if (gp_event_plugin_callback[i] != NULL)
        {
            gp_event_plugin_callback[i](pEvent_arg);
        }
    }
}

/******************************************************************************
* Function Name : EVENT_IsNotifyConnectionEstablished
* Interface     : uint8_t EVENT_IsNotifyConnectionEstablished(void)
* Description   : Return state of TCP/UPD connection
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
uint8_t EVENT_IsNotifyConnectionEstablished(void)
{
#if defined(__DEBUG)
    return TRUE;
#elif defined (_DLMS)
#if SUPPORT_UDP_PROFILE
    /* UDP */
    return R_UDP_WRP_IsConnected();
#else
    /* TCP */
    return R_TCP_WRP_IsConnected();
#endif
#else
    return TRUE;
#endif
}

/******************************************************************************
* Function Name : EVENT_IsLastGasp
* Interface     : uint8_t EVENT_IsLastGasp(void)
* Description   : Polling check lasp gasp
* Arguments     : None
* Function Calls: None
* Return Value  : uint8_t, 0 is not happen, 1 is happen
******************************************************************************/
uint8_t EVENT_IsLastGasp(void)
{
    return FALSE;//TODO (g_event_state.voltage_sag == EVENT_STATE_ENTER);
}

/******************************************************************************
* Function Name : EVENT_IsCurrentReversed
* Interface     : uint8_t EVENT_IsCurrentReversed(void)
* Description   : Check state of current reversed event
* Arguments     : None
* Function Calls: None
* Return Value  : uint8_t, 0 is not happen, 1 is happen
******************************************************************************/
uint8_t EVENT_IsCurrentReversed(void)
{
    return (g_event_state.cur_rev.current_state == EVENT_STATE_ENTER);
}

/******************************************************************************
* Function Name : EVENT_IsNeutralMissingHappen
* Interface     : uint8_t EVENT_IsNeutralMissingHappen(void)
* Description   : Polling check neutral missing status
* Arguments     : None
* Function Calls: None
* Return Value  : uint8_t, 0 is not happen, 1 is happen
******************************************************************************/
uint8_t EVENT_IsNeutralMissingHappen(void)
{
    return (g_event_state.neutral_missing.current_state == EVENT_STATE_ENTER);
}

