Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
/******************************************************************************
* Function Name : EVENT_IsEarthLoad
* Interface     : uint8_t EVENT_IsEarthLoad(void)
* Description   : Polling check earth load
* Arguments     : None
* Function Calls: None
* Return Value  : uint8_t, 0 is not happen, 1 is happen
******************************************************************************/
uint8_t EVENT_IsEarthLoad(void)
{
    return (g_event_state.earth_load.current_state == EVENT_STATE_ENTER);
}

/******************************************************************************
* Function Name : EVENT_IsCaseOpen
* Interface     : uint8_t EVENT_IsCaseOpen(void)
* Description   : Polling check case open
* Arguments     : None
* Function Calls: None
* Return Value  : uint8_t, 0 is not happen, 1 is happen
******************************************************************************/
uint8_t EVENT_IsCaseOpen(void)
{
    return (g_event_state.case_open.current_state == EVENT_STATE_ENTER);
}

/******************************************************************************
* Function Name : EVENT_IsMagnetic
* Interface     : uint8_t EVENT_IsMagnetic(void)
* Description   : Polling check magnetic
* Arguments     : None
* Function Calls: None
* Return Value  : uint8_t, 0 is not happen, 1 is happen
******************************************************************************/
uint8_t EVENT_IsMagnetic(void)
{
    return (g_event_state.magnet.current_state == EVENT_STATE_ENTER);
}

/******************************************************************************
* Function Name    : void EVENT_NeutralMissing(EVENT_STATE_T state)
* Description      : Event Callback for Neutral missing
* Arguments        : EVENT_STATE_T state: OCCURED or RECOVERED
* Functions Called : None
* Return Value     : None
******************************************************************************/
void EVENT_NeutralMissing(EVENT_STATE_T state)
{
    g_event_flag.bits.is_neutral_missing = 1;
    g_event_state.neutral_missing.current_state = state;
}

/******************************************************************************
* Function Name    : void EVENT_PowerFail(EVENT_STATE_T state)
* Description      : Event Callback for Power Fail
* Arguments        : None
* Functions Called : None
* Return Value     : None
******************************************************************************/
void EVENT_PowerFail(EVENT_STATE_T state)
{
    g_event_flag.bits.is_power_failed = 1;
    g_event_state.power_failed.current_state = state;
}

/******************************************************************************
* Function Name    : void EVENT_CaseOpen(EVENT_STATE_T state)
* Description      : Event Callback for Case Open
* Arguments        : None
* Functions Called : None
* Return Value     : None
******************************************************************************/
void EVENT_CaseOpen(EVENT_STATE_T state)
{
    g_event_flag.bits.is_case_open = 1;
    g_event_state.case_open.current_state = state;
}

/******************************************************************************
* Function Name    : void EVENT_PowerOn(void)
* Description      : Event Callback for Power On
* Arguments        : None
* Functions Called : None
* Return Value     : None
******************************************************************************/
void EVENT_PowerOn(void)
{
    //g_event_flag.is_power_on = 1;

    /* If sag happened, then meter reset, sag won't be release, so trigger release sag on enough power */
    //TODO: Rechecked when having powermgmt if (POWERMGMT_IsVDDLow() != TRUE) {
    //  EVENT_EM_SagVoltage(EM_EVENT_CALLBACK_STATE_RELEASE);
    //}
}

/******************************************************************************
* Function Name : EVENT_IsAllEventProcessed
* Interface     : uint8_t EVENT_IsAllEventProcessed(void)
* Description   : Check whether all happened events are processed or not.
* Arguments     : None
* Function Calls: None
* Return Value  : uint8_t
******************************************************************************/
uint8_t EVENT_IsAllEventProcessed(void)
{
	/* EM process */
	if ( *((uint16_t *)&g_event_flag) != 0)
	{
		return FALSE;
	}
	/* ACK all is OK */
	return TRUE;
}

/******************************************************************************
* Function Name: void EVENT_DetermineEventStatus(void)
* Description  : Process to determine event status
* Arguments    : None
* Return Value : None
******************************************************************************/
uint8_t EVENT_DetermineEventStatus(uint8_t condition, EVENT_ONE_EVENT_TICK *pEventStatus, uint8_t event_persistent_time_occur, uint8_t event_persistent_time_restore)
{
	uint8_t change = FALSE;

    if (condition)
    {   
        if (pEventStatus->occurred_count <= event_persistent_time_occur) 
            { 
                pEventStatus->occurred_count++;
            }
        pEventStatus->restored_count = 0;                                                                                                   
    }
    else
    {
        if (pEventStatus->restored_count <= event_persistent_time_restore) 
            { 
                pEventStatus->restored_count++;
            }
        pEventStatus->occurred_count = 0;
    }                   

    if ((pEventStatus->occurred_count > event_persistent_time_occur) &&
        (pEventStatus->current_state ==  EVENT_STATE_RELEASE))                 
    {                                                                               
        pEventStatus->current_state = EVENT_STATE_ENTER;
		change = TRUE; 
        pEventStatus->restored_count = 0;
    }

    if ((pEventStatus->restored_count > event_persistent_time_restore) &&
        (pEventStatus->current_state ==  EVENT_STATE_ENTER))         
    {                                                                               
        pEventStatus->current_state = EVENT_STATE_RELEASE;
		change = TRUE;
        pEventStatus->occurred_count = 0;
    }

