Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
	return change;
}


/******************************************************************************
* Function Name : EVENT_ExtractDataForLogging
* Interface     : void EVENT_ExtractDataForLogging(EventArgs *pEventArgsData)
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void EVENT_ExtractDataForLogging(EVENT_ARGS_T *pEventArgs)
{
    EM_PF_SIGN pf_sign;
    
    /* Get Snapshot Of Meter Data from gp_inst_LastDataPop*/
    pEventArgs->data.captured_time.Sec      = (gp_inst_DataPop->capture_time.sec);
    pEventArgs->data.captured_time.Min      = (gp_inst_DataPop->capture_time.min);
    pEventArgs->data.captured_time.Hour     = (gp_inst_DataPop->capture_time.hour);
    pEventArgs->data.captured_time.Day      = (gp_inst_DataPop->capture_time.day);
    pEventArgs->data.captured_time.Week     = (gp_inst_DataPop->capture_time.week);
    pEventArgs->data.captured_time.Month    = (gp_inst_DataPop->capture_time.month);
    pEventArgs->data.captured_time.Year     = ((uint8_t)gp_inst_DataPop->capture_time.year);

    pEventArgs->data.voltage 			= gp_inst_DataPop->value.vrms;

    // Notes: 
    //    gp_inst_DataPop->value.active_energy_total_import    : Import only
    //    R_TARIFF_GetImportActiveEnergyTotal()                : Check mode and (add export for MODE_FORWARDED_ONLY)
    pEventArgs->data.ActiveEnergyImport = R_TARIFF_GetImportActiveEnergyTotal();
    
    if (gp_inst_DataPop->value.selected_line == EM_LINE_PHASE)
    {
        pEventArgs->data.current 		= gp_inst_DataPop->value.irms;
        pEventArgs->data.PF 			= gp_inst_DataPop->value.power_factor;
        pf_sign                         = gp_inst_DataPop->value.power_factor_sign;
    }
    else
    {
        pEventArgs->data.current 		= gp_inst_DataPop->value.irms2;
        pEventArgs->data.PF 			= gp_inst_DataPop->value.power_factor2;
        pf_sign                         = gp_inst_DataPop->value.power_factor_sign2;
    }
    
    /* Indian standard representation sign of PF */
    pEventArgs->data.PF = fabsf(pEventArgs->data.PF);
    if (pf_sign == PF_SIGN_LEAD_C)
    {
        pEventArgs->data.PF = -pEventArgs->data.PF;
    }
}

/******************************************************************************
* Function Name: void EVENT_Detector(void)
* Description  : Process to detect event
* Arguments    : None
* Return Value : None
* Notes        : Please check if gp_inst_DataPop not null before call this function
******************************************************************************/
void EVENT_Detector(void)
{
    float32_t       i1, i2, ratio, max, sub;
    float32_t       voltage, irms, freq, pf;
    float32_t       act1, act2, react1, react2;
    uint8_t         is_state_enter;

    /* Prepare data for checking */

    /* Select the current channel that is considered better value */
    i1 = gp_inst_DataPop->value.irms;
    i2 = gp_inst_DataPop->value.irms2;
	
	act1 = gp_inst_DataPop->value.active_power;
    act2 = gp_inst_DataPop->value.active_power2;
	
	react1 = gp_inst_DataPop->value.reactive_power;
	react2 = gp_inst_DataPop->value.reactive_power2;
	
    EVENT_ExtractDataForLogging(&EventArgs);

    /* Start of checking code */

    
    /***********************
    * 1 min interval
    ***********************/
    if (gp_inst_DataPop->capture_time.sec == 0)
    {
        g_event_request_flag.min_interval = TRUE;
    }

    /***********************
    * Earth loading
    ***********************/
    /* Check ELT Condition */
    if (i1 >= EVENT_TAMPER_ELT_START_IRMS ||               /* ELT: Earth Load Threshold */
        i2 >= EVENT_TAMPER_ELT_START_IRMS)                 /* ELT: Earth Load Threshold */
    {
        /* Get difference percentage */
        max = MAX(i1, i2);
        sub = i1 - i2;

        /* Checking to issue earth connected event */
        g_event_flag.bits.is_earth_connected = EVENT_DetermineEventStatus(
                                                (((WRP_EXT_Absf(sub) * 100.0f) / max) >= EVENT_CONFIG_EARTH_DIFF_THRESHOLD),
                                                    &g_event_state.earth_load,
                                                    g_event_persistent_time.earth_occur,
                                                    g_event_persistent_time.earth_restore
                                                );
    }
    /***********************
    * DC Detection
    ***********************/
    /* Checking DC detection flag under wrp_em_adc */
    g_event_flag.bits.is_dc_detected = EVENT_DetermineEventStatus(
                                                (g_dc_immunity_state == 1),
                                                &g_event_state.dc_detected,
                                                g_event_persistent_time.dc_occur,
                                                g_event_persistent_time.dc_restore
                                            );
	
    /***********************
    * Low voltage & Over voltage
    ***********************/
    voltage = gp_inst_DataPop->value.vrms;//EM_GetVoltageRMS();

    /* Low voltage */
    g_event_flag.bits.is_low_voltage = EVENT_DetermineEventStatus(
                                            (voltage < EVENT_CONFIG_LOW_VOLTAGE_THRESHOLD),
                                            &g_event_state.low_voltage,
                                            g_event_persistent_time.low_voltage_occur,
                                            g_event_persistent_time.low_voltage_restore
                                        );
	
    /* Over voltage */
    g_event_flag.bits.is_over_voltage = EVENT_DetermineEventStatus(
                                            (voltage > EVENT_CONFIG_OVER_VOLTAGE_THRESHOLD),
                                            &g_event_state.over_voltage,
                                            g_event_persistent_time.over_voltage_occur,
                                            g_event_persistent_time.over_voltage_restore
                                        );

    /***********************
    * Over Current
    ***********************/
   
