Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
    irms = (gp_inst_DataPop->value.selected_line == EM_LINE_PHASE) ? i1 : i2;
    
    #if (EVENT_LOAD_CONTROL == FALSE)
        g_event_flag.bits.is_over_current = EVENT_DetermineEventStatus(
                                                    (irms > EVENT_CONFIG_OVER_CURRENT_THRESHOLD),
                                                    &g_event_state.over_current,
                                                    g_event_persistent_time.over_current_occur,
                                                    g_event_persistent_time.over_current_restore
                                                );
    #else
        g_event_flag.bits.is_over_current = R_LOAD_CTRL_Determine_OverCurrentEventStatus
                                            (
                                                (irms > EVENT_CONFIG_OVER_CURRENT_THRESHOLD),
                                                &is_state_enter
                                            );
        g_event_state.over_current.current_state = (is_state_enter == TRUE)?EVENT_STATE_ENTER:EVENT_STATE_RELEASE;
    #endif /* EVENT_LOAD_CONTROL */

	
    /***********************
    * Frequency out of range
    ***********************/
    freq = gp_inst_DataPop->value.freq;

    g_event_request_flag.is_freq_out_range = EVENT_DetermineEventStatus(
                                                    (freq < EVENT_CONFIG_FREQ_LOW_THRESHOLD || freq > EVENT_CONFIG_FREQ_HIGH_THRESHOLD),
                                                    &g_event_state.freq_out_range,
                                                    g_event_persistent_time.freq_out_range,
                                                    g_event_persistent_time.freq_out_range
                                                );

    /***********************
    * Low PF
    ***********************/
    if (WRP_EXT_Absf(act1) != 0.0f ||
		WRP_EXT_Absf(act2) != 0.0f ||
		WRP_EXT_Absf(react1) != 0.0f ||
		WRP_EXT_Absf(react2) != 0.0f )
    {
        if ( gp_inst_DataPop->value.selected_line == EM_LINE_NEUTRAL)
        {
            pf = WRP_EXT_Absf(gp_inst_DataPop->value.power_factor2);
        }   
        else
        {
            pf = WRP_EXT_Absf(gp_inst_DataPop->value.power_factor);
        }
        
        g_event_flag.bits.is_low_pf = EVENT_DetermineEventStatus(
                                                (pf < EVENT_CONFIG_PF_LOW_THRESHOLD),
                                                &g_event_state.low_pf,
                                                g_event_persistent_time.low_power_pf_occur,
                                                g_event_persistent_time.low_power_pf_restore
                                            );

    }

    /***********************
    * Current reversed
    ***********************/
    

    g_event_flag.bits.is_cur_rev = EVENT_DetermineEventStatus(
                                                (act1 < 0.0f || act2 < 0.0f),
                                                &g_event_state.cur_rev,
                                                g_event_persistent_time.current_rev_occur,
                                                g_event_persistent_time.current_rev_restore
                                            );

    /***********************
    * Overload
    ***********************/
    #if (EVENT_LOAD_CONTROL == FALSE)
        g_event_flag.bits.is_overload = EVENT_DetermineEventStatus(
                                    (WRP_EXT_Absf(act1) > g_event_overload_threshold || 
                                        WRP_EXT_Absf(act2) > g_event_overload_threshold),
                                    &g_event_state.overload,
                                    g_event_persistent_time.overload_occur,
                                    g_event_persistent_time.overload_restore
                                );
    #else
        g_event_flag.bits.is_overload = R_LOAD_CTRL_Determine_OverLoadEventStatus
                                            (
                                                (WRP_EXT_Absf(act1) > g_event_overload_threshold || 
                                                    WRP_EXT_Absf(act2) > g_event_overload_threshold),
                                                &is_state_enter
                                            );
        g_event_state.overload.current_state = (is_state_enter == TRUE)?EVENT_STATE_ENTER:EVENT_STATE_RELEASE;
    #endif /* EVENT_LOAD_CONTROL */

    /***********************
    * Magnet
    ***********************/
    g_event_flag.bits.is_magnet = EVENT_DetermineEventStatus(
                                            (MAGNET == 0),
                                            &g_event_state.magnet,
                                            g_event_persistent_time.magnet_occur,
                                            g_event_persistent_time.magnet_restore
                                        );

    /***********************
    * Case open
    ***********************/
    g_event_flag.bits.is_case_open = EVENT_DetermineEventStatus(
                                            (CASE == 0),
                                            &g_event_state.case_open,
                                            g_event_persistent_time.case_open,
                                            g_event_persistent_time.case_open
                                        );

    /* Load Control for case open */
    #if (defined( EVENT_LOAD_CONTROL ) && EVENT_LOAD_CONTROL == TRUE)
    if (g_event_flag.bits.is_case_open)
    {
        if (g_event_state.case_open.current_state == EVENT_STATE_ENTER) {
            R_LOADCTRL_LocalMgmt_Disconn(R_LOADCONTROL_LOCAL_SIGNAL_CASEOPEN);
        }
        else {
            R_LOADCTRL_LocalMgmt_Reconn(R_LOADCONTROL_LOCAL_SIGNAL_CASEOPEN);
        }
    }    
    #endif /* EVENT_LOAD_CONTROL */

    /* End of checking code */
}
/*****************************************************************************
* Function Name : EVENT_Distributor() 
* Interface     : void EVENT_Distributor(
*               :     void
*               : );
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void EVENT_Distributor(void)
{
    /**************************
        When firmware activation 
    **************************/
    if (g_scheduler[SCHEDULER_ID_FW_ACTIVATION].matched == TRUE)
    {   
        g_event_request_flag.is_fw_activation = 1;
        g_scheduler[SCHEDULER_ID_FW_ACTIVATION].matched = FALSE;
    }

    /***********************
        MaxDemand End
    ***********************/
    if (g_scheduler_flags.mdm == 1)
    {
        g_event_request_flag.is_max_demand_end = 1;
        g_scheduler_flags.mdm = FALSE;
    }

    /***********************
        TARIFF CHANGE
    ***********************/
    /* When tariff changed */
    if (g_scheduler[SCHEDULER_ID_TARIFF].matched == TRUE)
    {
        g_event_request_flag.is_tariff_changed = 1;
        g_scheduler[SCHEDULER_ID_TARIFF].matched = FALSE;
    }

    /*************************
        When 0.5S scheduler refresh LCD display request occured
     *************************/
    if (g_scheduler_flags.lcd_refresh == 1)
    {   
        g_event_request_flag.is_lcd_refresh = 1;
        g_scheduler_flags.lcd_refresh = FALSE;
    }

    /*************************
        When 5S scheduler scroll LCD display request occured 
	*************************/
    if (g_scheduler_flags.lcd_scroll == 1)
    {   
        g_event_request_flag.is_lcd_scroll = 1;
        g_scheduler_flags.lcd_scroll = FALSE;
    }

    /*************************
        When billing request 
    *************************/
    if (g_scheduler[SCHEDULER_ID_BILLING].matched == TRUE)
    {   
        g_event_request_flag.is_billing_request = 1;
        g_scheduler[SCHEDULER_ID_BILLING].matched = FALSE;
    }

    /*************************
        When blockload request 
    *************************/
    if (g_scheduler_flags.blockload == 1)
    {   
        g_event_request_flag.is_blockload_request = 1;
        g_scheduler_flags.blockload = FALSE;
    }

    /*************************
        When daily load request 
    *************************/
    if (g_scheduler_flags.dailyload == 1)
    {   
        g_event_request_flag.is_dailyload_request = 1;
        g_event_request_flag.act_cal_week_profile_change = 1;
        g_scheduler_flags.dailyload = FALSE;
    }


	/* TODO Need to uncomment all lines below after merge to master branch */
    /*************************
        When Push request 
    *************************/
    if (g_scheduler[SCHEDULER_ID_PERIODIC_CH0].matched == TRUE)
    {   
        g_event_request_flag.periodic_msg_1 = 1;
        g_scheduler[SCHEDULER_ID_PERIODIC_CH0].matched = FALSE;
    }
    /*************************
        When Activity Calendar activation request 
    *************************/
    if (g_scheduler[SCHEDULER_ID_ACTIVITY_CAL_ACT].matched == TRUE)
    {   
        g_event_request_flag.is_cal_active_req = 1;
        g_scheduler[SCHEDULER_ID_ACTIVITY_CAL_ACT].matched = FALSE;
    }

    if (g_scheduler[SCHEDULER_ID_ACTIVITY_CAL_SEASON].matched == TRUE)
    {   
        g_event_request_flag.act_cal_season_change = 1;
        g_scheduler[SCHEDULER_ID_ACTIVITY_CAL_SEASON].matched = FALSE;
    }

    /*************************
        When rtc failed
    *************************/

