Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
}

/***********************************************************************************************************************
* Function Name : EVENT_StorageWrite
* Description   : Add event log and backup the event state of paired event. 
*               : Only 1 is logged, for array of log, do it on other application
*               : Note: currently support power failed event log only
* Arguments     : SINGLE_PAIR_EVENTLOG_T * p_event_info
* Return Value  : None
***********************************************************************************************************************/
void EVENT_StorageWrite(EVENT_ARGS_T * pEventArgs)
{

    uint32_t TableStartAddress;
    uint32_t EntryLogSize;
    uint8_t is_log;

    uint32_t WritePositionIndex;
    uint32_t WriteAddr;

    EventTableConfig_t TableConfig;
    EventTableHeader_t TableHeader;

    EVENT_PARAMS_SHORT_T short_log;

    if (pEventArgs->data.code == 0)
    {
        return;
    }

    /* EEPROM Address */
    TableConfig = gEventTableConfigs[pEventArgs->type];
    TableHeader = gEventTableHeaders[pEventArgs->type];
    EntryLogSize = TableConfig.LogSize;

    WritePositionIndex = (TableHeader.StartPosition + TableHeader.EntriesInUse) % TableConfig.MaxEntries;

    /* Calculation index */
    {
        if (TableConfig.IsRollover == FALSE && (TableHeader.EntriesInUse >= TableConfig.MaxEntries))
        {
            /* Do not log if buffer is none rollover and full already */
            return;
        }

        if (TableHeader.EntriesInUse >= TableConfig.MaxEntries)
        {
            TableHeader.EntriesInUse = TableConfig.MaxEntries;
            TableHeader.StartPosition = (TableHeader.StartPosition + 1) % TableConfig.MaxEntries;
        }
        else
        {
            TableHeader.EntriesInUse++;
        }
    }

    WriteAddr = TableConfig.TableStartAddr + WritePositionIndex * EntryLogSize;
    /* Write the log */
    EPR_Write(
        WriteAddr,
        (uint8_t *)(void *)&pEventArgs->data,
        EntryLogSize
    );

    gEventTableHeaders[pEventArgs->type] = TableHeader;
}


/******************************************************************************
* Function Name : EVENT_AccumulateTamperCounter
* Interface     : void EVENT_AccumulateTamperCounter(EVENT_ARGS_T *pEventArgs)
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void EVENT_AccumulateTamperCounter(EVENT_ARGS_T *pEventArgs)
{
    /* Increase Tamper Counter */
    if ((pEventArgs->type == EVENT_TYPE_VOLTAGE_RELATED) ||
        (pEventArgs->type == EVENT_TYPE_OTHERS) ||
        (pEventArgs->type == EVENT_TYPE_CURRENT_RELATED))
    {
        if (pEventArgs->status == EVENT_STATE_ENTER)
        {
            g_tamper_counter++;
            pEventArgs->data.TamperCounter = g_tamper_counter;
        }
    }
}

/*****************************************************************************
* Function Name : EVENT_Logging 
* Interface     : void EVENT_Logging(
*               :     void
*               : );
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void EVENT_Logging(void)
{
    uint8_t bit_id1 = 0;
    uint32_t mask = 1u;
    uint8_t  found_bit = FALSE;
    uint32_t indicator_event_mask_bit = 0x000FFFFF;
    uint32_t event_indicator_flag;
    
     /* Get list of indicator flag */
    event_indicator_flag = g_event_flag.value & indicator_event_mask_bit;

    do
    {
        /* code */
        //Get bit ID
        if ((event_indicator_flag & mask) == 0) 
        {
            found_bit = FALSE;
        }
        else
        {   
            found_bit = TRUE;
            g_event_flag.value &= ~ mask;
        }
        bit_id1 ++;
        event_indicator_flag &= ~ mask;
        mask = mask << 1;

        if ( found_bit == TRUE)
        {
            switch (bit_id1)
            {
            case 1: // low voltage   
                if( g_event_state.low_voltage.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_LOW_VOLTAGE_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_LOW_VOLTAGE_RESTORATION;
                }
                EventArgs.type              = (EVENT_TYPE_T)0;
                EventArgs.esw_bit_number    = 4;
                break;

            case 2: // over voltage (voltage swell) 
                if( g_event_state.over_voltage.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_OVERVOLTAGE_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_OVERVOLTAGE_RESTORATION;
                }
                EventArgs.type              = (EVENT_TYPE_T)0;
                EventArgs.esw_bit_number    = 3;
                break;

            case 3: // over current
                if( g_event_state.over_current.current_state== EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_OVER_CURRENT_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_OVER_CURRENT_RESTORATION;
                }
                EventArgs.type              = (EVENT_TYPE_T)1;
                EventArgs.esw_bit_number    = 11;
                break;

            case 4: // current reverse
                if( g_event_state.cur_rev.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_CURRENT_REVERSE_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_CURRENT_REVERSE_RESTORATION;
                }
                EventArgs.type              = (EVENT_TYPE_T)1;
                EventArgs.esw_bit_number    = 0xFF;
                break;

            case 5: // overload
                if( g_event_state.overload.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_OVERLOAD_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_OVERLOAD_RESTORATION;
                }
                EventArgs.type              = (EVENT_TYPE_T)4;
                EventArgs.esw_bit_number    = 0xFF;
                break;

