Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
            case 6: // low power factor
                if( g_event_state.low_pf.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = 0;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = 0;
                }
                EventArgs.type              = (EVENT_TYPE_T)4;
                EventArgs.esw_bit_number    = 0xFF;
                break;

            case 7: // Neutral Missing 
                if( g_event_state.neutral_missing.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_NEUTRAL_MISSING_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_NEUTRAL_MISSING_RESTORATION;
                }
                EventArgs.type              = (EVENT_TYPE_T)4;
                EventArgs.esw_bit_number    = 0xFF;
                break;

            case 8: // Earth connected 
                if( g_event_state.earth_load.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_EARTH_LOADING_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_EARTH_LOADING_RESTORATION;
                }
                EventArgs.type              = (EVENT_TYPE_T)1;
                EventArgs.esw_bit_number    = 51;
                break;

            case 9: // DC detectiom
                if( g_event_state.dc_detected.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_NEUTRAL_DISTURBANCE_HF_AND_DC_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_NEUTRAL_DISTURBANCE_HF_AND_DC_RESTORATION;
                }
                EventArgs.type              = (EVENT_TYPE_T)4;
                EventArgs.esw_bit_number    = 82;
                break;

            case 10: // power failures occur (voltage sag) (last gasp)/ power failures restore ( first breath)
                if( g_event_state.power_failed.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_POWER_FAILURE_OCCURRENCE;
                    EventArgs.esw_bit_number = 85;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_POWER_FAILURE_RESTORATION;
                    EventArgs.esw_bit_number = 86;
                }
                EventArgs.type = (EVENT_TYPE_T)2;
                break;

            case 11: // magnetic
                if( g_event_state.magnet.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_INFLUENCE_OF_PERMANENT_MAGNET_OR_ACDC_ELECTROMAGNET_OCCURRENCE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_INFLUENCE_OF_PERMANENT_MAGNET_OR_ACDC_ELECTROMAGNET_RESTORATION;
                } 
                EventArgs.type              = (EVENT_TYPE_T)4;
                EventArgs.esw_bit_number    = 81;
                break;

            case 12: // case open
                if( g_event_state.case_open.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_METER_COVER_OPENING_OCCURRENCE;
                    EventArgs.type          = (EVENT_TYPE_T)5;
                    EventArgs.esw_bit_number = 83;
                }
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    // No event code and type to log for case open release event
                    EventArgs.data.code     = 0;
                    EventArgs.type          = EVENT_TYPE_UNKNOWN;
                    EventArgs.esw_bit_number = 0xFF;
                }
                break;

            case 13: // post-paid mode/ pre-paid mode 
                if( g_event_state.paid_mode.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_POSTPAID_MODE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_PREPAID_MODE;
                } 
                EventArgs.type              = (EVENT_TYPE_T)4;
                EventArgs.esw_bit_number    = 0xFF;
                break;

            case 14: // forwarded only mode/ import and export mode
                if( g_event_state.meter_mode.current_state == EVENT_STATE_ENTER)
                {
                    EventArgs.status        = EVENT_STATE_ENTER;
                    EventArgs.data.code     = EVENT_ID_FORWARDED_ONLY_MODE;
                } 
                else
                {
                    EventArgs.status        = EVENT_STATE_RELEASE;
                    EventArgs.data.code     = EVENT_ID_IMPORT_AND_EXPORT_MODE;
                } 
                EventArgs.type              = (EVENT_TYPE_T)4;
                EventArgs.esw_bit_number    = 0xFF;
                break;

