Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
			case 15:    // Increase in billing counter: none
				EventArgs.type              = (EVENT_TYPE_T)0xFF;	
				EventArgs.status            = EVENT_STATE_ENTER;
				EventArgs.data.code         = EVENT_ID_INCREASE_BILLING_COUNTER;
				EventArgs.esw_bit_number    = 87;
				break;
				
			
			case 16:// set RTC: 151
				EventArgs.type              = (EVENT_TYPE_T)3;	
				EventArgs.status            = EVENT_STATE_ENTER;
				EventArgs.data.code         = EVENT_ID_REAL_TIME_CLOCK_DATE_AND_TIME;
				EventArgs.esw_bit_number    = 0xFF;
				break;	
				
			case 17:// set Demand Integration Period: 152	
				EventArgs.type              = (EVENT_TYPE_T)3;	
				EventArgs.status            = EVENT_STATE_ENTER;
				EventArgs.data.code         = EVENT_ID_DEMAND_INTEGRATION_PERIOD;
				EventArgs.esw_bit_number    = 0xFF;
				break;
				
			case 18:// set Profile Capture Period: 153
				EventArgs.type              = (EVENT_TYPE_T)3;	
				EventArgs.status            = EVENT_STATE_ENTER;
				EventArgs.data.code         = EVENT_ID_PROFILE_CAPTURE_PERIOD;
				EventArgs.esw_bit_number    = 0xFF;
				break;
				
			case 19:// set SAS for Billing Dates: 154
				EventArgs.type              = (EVENT_TYPE_T)3;	
				EventArgs.status            = EVENT_STATE_ENTER;
				EventArgs.data.code         = EVENT_ID_SINGLEACTION_SCHEDULE_FOR_BILLING_DATES;
				EventArgs.esw_bit_number    = 0xFF;
				break;
				
			case 20:// MD reset: 166
				EventArgs.type              = (EVENT_TYPE_T)3;	
				EventArgs.status            = EVENT_STATE_ENTER;
				EventArgs.data.code         = EVENT_ID_MD_RESET;
				EventArgs.esw_bit_number    = 0xFF;
				break;
            default:
                
                break;
            }

            /* Extract data from snapshot (only extract when event happend) */
            EVENT_FowardToPluginFn(&EventArgs);
            EVENT_AccumulateTamperCounter(&EventArgs);
            EVENT_StorageWrite(&EventArgs);
            
        }

        if ( bit_id1 > 20)
        {
            bit_id1 = 1;
            mask = 1u;
        }
    
    } while ( event_indicator_flag !=0 );
    
}

/*****************************************************************************
* Function Name : EVENT_CheckAndTriggerTamperEnergyAccumulation 
* Interface     : void EVENT_CheckAndTriggerTamperEnergyAccumulation(void)
* Description   : Check for tamper event the need fixed power pulse output and energy update
*               : In case multiple tamper, highest tamper power is selected
*               : If there's tamper power, inform instantaneous snapshot to:
*               :   * Stop metrology actual energy accumulating in timer
*               :   * Update energy directly by fixed power every 1s in snapshot RTC interrupt
*               :   * Update pulse output by fixed power value
*               : If no tamper power needed, inform instantaneous snapshot to:
*               :   * Normal metrology actual energy accumulating in timer
*               :   * Update pulse output by actual read power value
* Arguments     : None
* Return Value  : None
******************************************************************************/
void EVENT_CheckAndTriggerTamperEnergyAccumulation(void)
{
    /* Default update energy normally with no specified power */
    r_event_tamper_update_mode update_mode = EVENT_TAMPER_UPDATE_NORMAL;
    float32_t specified_power = 0.0f;

    /* Earthing */
    EVENT_CHECK_TAMPER_UPDATING_MODE(
        EVENT_TAMPER_EARTHING_ENERGY_UPDATE_MODE,
        EVENT_TAMPER_EARTHING_SPECIFIED_POWER,
        g_event_state.earth_load.current_state,
        update_mode, specified_power
    );
    /* Magnet */
    EVENT_CHECK_TAMPER_UPDATING_MODE(
        EVENT_TAMPER_MAGNET_ENERGY_UPDATE_MODE,
        EVENT_TAMPER_MAGNET_SPECIFIED_POWER,
        g_event_state.magnet.current_state,
        update_mode, specified_power
    );
    /* Case open */
    EVENT_CHECK_TAMPER_UPDATING_MODE(
        EVENT_TAMPER_CASE_OPEN_ENERGY_UPDATE_MODE,
        EVENT_TAMPER_CASE_OPEN_SPECIFIED_POWER,
        g_event_state.case_open.current_state,
        update_mode, specified_power
    );
    /* DC Detection */
    EVENT_CHECK_TAMPER_UPDATING_MODE(
        EVENT_TAMPER_DC_DETECTION_ENERGY_UPDATE_MODE,
        EVENT_TAMPER_DC_DETECTION_SPECIFIED_POWER,
        g_event_state.dc_detected.current_state,
        update_mode, specified_power
    );

    /* Update pulse one time in case specified power */
    if (update_mode == EVENT_TAMPER_UPDATE_BY_SPECIFIED_POWER &&
        EM_GetEnergyAccumulationMode() == 3)
    {
        /* Energy accumulation mode 0, continue using last calculated power in metrology */
        EM_SetEnergyAccumulationMode(0);
        /* Set tamper power */
        EM_SetEnergyAccumulationPower(specified_power, 0.0f, specified_power);
    }
    else if (update_mode == EVENT_TAMPER_UPDATE_NORMAL &&
             EM_GetEnergyAccumulationMode() == 0)
    {
        /* Set normal power */
        EM_SetEnergyAccumulationPower(gp_inst_DataPop->value.active_power, gp_inst_DataPop->value.reactive_power, gp_inst_DataPop->value.apparent_power);
        /* Energy accumulation mode 3, update using normal power, from next */
        EM_SetEnergyAccumulationMode(3);
    }
}

/******************************************************************************
* Function Name    : void EVENT_PollingProcessing(void)
* Description      : Event Polling Processing
* Arguments        : None
* Functions Called : EVENT_BackupSystemAndRTC()
*                  : DEBUG_Printf()
*                  : DEBUG_AckNewLine()
*                  : RTC_CounterGet()
*                  : EVENT_AddEnergyLog()
*                  : STORAGE_AddEnergyLog()
* Return Value     : None
******************************************************************************/
void EVENT_PollingProcessing(void)
{
    uint8_t status;

    if (gp_inst_DataPop != NULL)
    {
        /* Start of checking code */
        EVENT_Detector();
    }

    EVENT_Logging();
        
    EVENT_Distributor();
    
