Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
    EVENT_CheckAndTriggerTamperEnergyAccumulation();
}

/******************************************************************************
* Function Name    : uint8_t EVENT_StorageFormat(void)
* Description      : 
* Arguments        : None
* Functions Called : None
* Return Value     : 
******************************************************************************/
uint8_t EVENT_StorageFormat(void)
{
    uint32_t    eeprom_addr;
    uint8_t     empty_page[STORAGE_EEPROM_PAGESIZE];
    uint16_t    size;

    /* Create empty_page */
    memset(empty_page, 0, sizeof(empty_page));

    /* Clear Whole EEPROM */
    eeprom_addr = STORAGE_EEPROM_EVENT_LOG_NONROLLOVER_ADDR;
    while (eeprom_addr < STORAGE_EEPROM_EVENT_LOG_LAST_ADDR)
    {
        if ((STORAGE_EEPROM_EVENT_LOG_LAST_ADDR - eeprom_addr) < STORAGE_EEPROM_PAGESIZE) {
            size = STORAGE_EEPROM_EVENT_LOG_LAST_ADDR - eeprom_addr;
        }
        else {
            size = STORAGE_EEPROM_PAGESIZE;
        }

        if (EPR_Write(eeprom_addr, empty_page, size) != EPR_OK)
        {
            return STORAGE_ERROR;
        }

        eeprom_addr += size;

        R_WDT_Restart();
    }

    /* Formatted */
    return STORAGE_OK;
}

/******************************************************************************
* Function Name    : uint8_t EVENT_StorageRestore(void)
* Description      :
* Arguments        : None
* Functions Called : None
* Return Value     :
******************************************************************************/
uint8_t EVENT_StorageRestore(void)
{   

    if (EPR_Read(
                EVENT_EEPROM_BACKUP_EVENT_STATE_ADDR,
                (uint8_t *)&g_event_state,
                sizeof(EVENT_INFO)
            ) != EPR_OK)
    {
        return STORAGE_ERROR;
    }

    if (EPR_Read(
                EVENT_EEPROM_BACKUP_EVENT_TAMPER_COUNTER_ADDR,
                (uint8_t *)&g_tamper_counter,
                sizeof(g_tamper_counter)
            ) != EPR_OK)
    {
        return STORAGE_ERROR;
    }


    if (EPR_Read(
                EVENT_EEPROM_BACKUP_EVENT_TABLE_HEADER_ADDR,
                (uint8_t *)&gEventTableHeaders[0],
                sizeof(gEventTableHeaders)
            ) != EPR_OK)
    {
        return STORAGE_ERROR;
    }

    return STORAGE_OK;
}
/******************************************************************************
* Function Name    : uint8_t EVENT_StorageBackup(void)
* Description      :
* Arguments        : None
* Functions Called : None
* Return Value     :
******************************************************************************/
uint8_t EVENT_StorageBackup(void)
{
    if (EPR_Write(
                EVENT_EEPROM_BACKUP_EVENT_STATE_ADDR,
                (uint8_t *) &g_event_state,
                sizeof(EVENT_INFO)
            ) != EPR_OK)
        {
            return STORAGE_ERROR;
        }

    if (EPR_Write(
                EVENT_EEPROM_BACKUP_EVENT_TAMPER_COUNTER_ADDR,
                (uint8_t *) &g_tamper_counter,
                sizeof(g_tamper_counter)
            ) != EPR_OK)
        {
            return STORAGE_ERROR;
        }
    
    if (EPR_Write(
                EVENT_EEPROM_BACKUP_EVENT_TABLE_HEADER_ADDR,
                (uint8_t *) &gEventTableHeaders,
                sizeof(gEventTableHeaders)
            ) != EPR_OK)
        {
            return STORAGE_ERROR;
        }

    return STORAGE_OK;
}

/******************************************************************************
* Function Name    : uint8_t EVENT_Init(void)
* Description      : Event Init
* Arguments        : None
* Functions Called : None
* Return Value     : Execution status
*                  : EVENT_OK       Success
*                  : EVENT_ERROR    Register event failed
******************************************************************************/
uint8_t EVENT_Init(void)
{
    /* Reset event flag */
    memset(&g_event_flag, 0, sizeof(EVENT_FLAG));

    /* Success all */
    return EVENT_OK;
}
/**********************************************************************************************************************
 * Function Name: R_EVENT_EntriesInUseGet      
 * Description  : Function to get entries in use
 * Arguments    : event_type - enum type of event to get, 
 *                p_data_out -  pointer of entries in use to get.
 * Return Value : TRUE - get successfully, FALSE - get unsuccessfully.                  
 **********************************************************************************************************************/ 
uint8_t R_EVENT_EntriesInUseGet(EVENT_TYPE_T event_type, uint32_t * p_data_out)
{
    if ((uint8_t)event_type > (uint8_t)LAST_EVENT_TYPE)
    {
        return FALSE;
    }
    
    (*p_data_out) = gEventTableHeaders[(uint8_t)event_type].EntriesInUse;

	return TRUE;
}


/**********************************************************************************************************************
 * Function Name: R_EVENT_ProfileEntriesGet      
 * Description  : Function to get profile entries
 * Arguments    : event_type - enum type of event to get, 
 *                p_data_out -  pointer of profile entries to get.
 * Return Value : TRUE - get successfully, FALSE - get unsuccessfully.                  
 **********************************************************************************************************************/ 
uint8_t R_EVENT_ProfileEntriesGet(EVENT_TYPE_T event_type, uint32_t * p_data_out)
{
    if ((uint8_t)event_type > (uint8_t)LAST_EVENT_TYPE)
    {
        return FALSE;
    }
    
    (*p_data_out) = gEventTableConfigs[(uint8_t)event_type].MaxEntries;

	return TRUE;
}


/**********************************************************************************************************************
 * Function Name: R_EVENT_ResetLog      
 * Description  : Function to execute Clear log 
 * Arguments    : event_type - enum type of event to execute clear log.
 * Return Value : TRUE - action successfully, FALSE - action unsuccessfully.                  
 **********************************************************************************************************************/ 
uint8_t R_EVENT_ResetLog(EVENT_TYPE_T event_type)
{
    if (event_type > LAST_EVENT_TYPE)
    {
        return FALSE;
    }

    gEventTableHeaders[event_type].StartPosition = 0;
    gEventTableHeaders[event_type].EntriesInUse = 0;
    
