Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/application/event/event.c
    return TRUE;
}

/******************************************************************************
* Function Name : R_EVENT_GetEntry
* Interface     : EVENT_PARAMS_T R_EVENT_GetEntry(
*               :     EVENT_TYPE_T EventType, uint32_t EntryIndex
*               : );
* Description   :
* Arguments     :
* Return Value  : EVENT_PARAMS_T
******************************************************************************/
EVENT_PARAMS_T R_EVENT_GetEntry(EVENT_TYPE_T EventType, uint16_t EntryIndex)
{
    EventTableConfig_t TableConfig;
    EventTableHeader_t TableHeader;
    uint32_t EntryLogSize;
    uint32_t ReadPositionIndex;
    uint32_t ReadAddr;

    EVENT_PARAMS_T EntryData;

    memset(&EntryData, 0, sizeof(EVENT_PARAMS_T));

    /* EEPROM Address */
    TableConfig = gEventTableConfigs[EventType];
    TableHeader = gEventTableHeaders[EventType];
    EntryLogSize = TableConfig.LogSize;

    ReadPositionIndex = (TableHeader.StartPosition + EntryIndex) % TableConfig.MaxEntries;
    ReadAddr = TableConfig.TableStartAddr + (ReadPositionIndex * EntryLogSize);

    /* Write the log */
    EPR_Read(
        ReadAddr,
        (uint8_t *)(void *)&EntryData,
        EntryLogSize
    );

    return EntryData;
}



/******************************************************************************
* Function Name: float32_t EVENT_GetOverLoadThreshold(void)
* Description  : Energy Event Get over load threshold
* Arguments    : None
* Return Value : float32_t current value
******************************************************************************/
float32_t EVENT_GetOverLoadThreshold(void)
{
    return g_event_overload_threshold;
}

/******************************************************************************
* Function Name: void EVENT_SetOverLoadThreshold(float32_t value)
* Description  : Energy Event Set over load threshold
* Arguments    : float32_t value: set value
* Return Value : None
******************************************************************************/
void EVENT_SetOverLoadThreshold(float32_t value)
{
    g_event_overload_threshold = value;
}


